{
    "homepage": "https://github.com/glektarssza/minecraft-gtnh-customizer",
    "1.7.10": {
        "0.12.3": "* Fixed the '/extinguish' command causing an error when using the '/help' command the proper way...",
        "0.12.2": "* Fixed the '/extinguish' command causing an error when using the '/help' command.",
        "0.12.1": "* Fixed the '/extinguish' command causing an error on server consoles.",
        "0.12.0": "* Fixed the '/nbtedit' UI closing when you used the 'accept' hotkey.\n* Added a setting to disable Enderman and Enderman-like mobs from teleporting.",
        "0.11.1": "* Fixed key bindings being loaded on the server side, causing a crash.",
        "0.11.0": "* Fall back to in-hand item if block has no tile entity when calling '/nbtedit'.\n * Support a shortcut key to delete the selected NBT tag inside the '/nbtedit' command'.\n * Add key bindings.",
        "0.10.0": "* Patch ServerUtilities' '/nbtedit' command to let you use 'numpad enter' to submit your changes.",
        "0.9.0": "* Patch ServerUtilities' '/nbtedit' command to edit the in-hand item (if present) if the in-world ray cast doesn't hit anything.",
        "0.8.0": "* Added the ability to bone meal Thaumcraft saplings.",
        "0.7.0": "* Fixed changing configs while single player world is running not taking.\n * Big config overhaul, moved gameplay-related configs into their own sections.\n * Moved Tinker's Construct-related config items into a sub-section of gameplay config items.\n * Tinker's Construct Slime Sapling bone mealing can now be toggled on/off in the settings.",
        "0.6.3": "* Fixed repair command not applying to Tinker's and Gregtech tools.",
        "0.6.2": "* Fixed reload command not working properly on servers.",
        "0.6.1": "* Fixed a bad render distance access on servers in the extinguish command.",
        "0.6.0": "* Added a command to extinguish flames in an area.",
        "0.5.3": "* Adjusted admin output of repair command.",
        "0.5.2": "* Fixed an issue where the repair command was formatting the number of repaired items VERY wrong.",
        "0.5.1": "* Fixed an issue where the teleport command was parsing coordinates wrong.",
        "0.5.0": "* Added a command to repair items that can be repaired in various inventory types.",
        "0.4.0": "* Added a mixin to permit applying bone meal to Tinker's Construct slime saplings.",
        "0.3.1": "* Fixed Zombie Pigmen attacking when you mine ores in the Nether.",
        "0.3.0": "* Integrated into ServerUtils.",
        "0.2.3": "* Fixed mixins not applying correctly to Xaero's.",
        "0.2.2": "* Fixed broken teleport command.",
        "0.2.1": "* Fixed teleport command argument processing.",
        "0.2.0": "* Added ability to customize Xaero's teleport command.",
        "0.1.2": "* Fixed teleport command not respecting coordinates.",
        "0.1.1": "* Fixed config migrations.",
        "0.1.0": "* Updated several dependencies.\n * Added a cross-dimension teleport command.\n * Changed logo.\n * Ported existing code from old repository.",
        "0.0.0": "Initial release."
    },
    "promos": {
        "1.7.10-latest": "0.13.0",
        "1.7.10-recommended": "0.13.0"
    }
}
